source/xml/Catalogs/СоглашенияСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СоглашенияСКлиентами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

source/xml/Catalogs/СоглашенияСКлиентами/Ext/ManagerModule.bsl
Функция ОтправитьНаСайт(СсылкаНаОбъект, ПолнаяВыгрузка) Экспорт
	Возврат web_Справочники.ОтправитьСоглашение(СсылкаНаОбъект, ПолнаяВыгрузка);
КонецФункции

Функция ПолучитьСвязанныеСсылки(СсылкаНаОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоглашенияСКлиентами.Партнер КАК Партнер,
		|	СоглашенияСКлиентами.Контрагент КАК Контрагент,
		|	СоглашенияСКлиентами.Организация КАК Организация
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	СписокСсылок = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СписокСсылок.Вставить(СсылкаНаОбъект, 0);	
		Возврат СписокСсылок;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	МаксимальныйПриоритет = 0;
	web_ОбщегоНазначения.ЗаписатьЗависимыеСсылкиПоОбъекту(Выборка.Партнер, СписокСсылок, МаксимальныйПриоритет);
	web_ОбщегоНазначения.ЗаписатьЗависимыеСсылкиПоОбъекту(Выборка.Контрагент, СписокСсылок, МаксимальныйПриоритет);
	web_ОбщегоНазначения.ЗаписатьЗависимыеСсылкиПоОбъекту(Выборка.Организация, СписокСсылок, МаксимальныйПриоритет);
	
	СписокСсылок.Вставить(СсылкаНаОбъект, МаксимальныйПриоритет + 1);
	Возврат СписокСсылок;
КонецФункции
